web_services/wsdl_soap_with_requests/ch/templates/soaprequests/EZStockQuoteSericeRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetQuote xmlns="http://www.webserviceX.NET/">
      <symbol>{{ data }}</symbol>
    </GetQuote>
  </soap:Body>
</soap:Envelope>